In [2]:
import pandas as pd 
df=pd.read_csv('https://raw.githubusercontent.com/resbaz/r-novice-gapminder-files/master/data/gapminder-FiveYearData.csv')

In [3]:
df.head(3)

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710

In [7]:
df.sort_values('lifeExp')

              country  year          pop continent  lifeExp     gdpPercap
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
552            Gambia  1952     284320.0    Africa   30.000    485.230659
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
...               ...   ...          ...       ...      ...           ...
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
803             Japan  2007  127467972.0      Asia   82.603  31656.068060

[1704 rows x 6 columns]

In [15]:
df=df.sort_values('lifeExp',ascending=False)
df.head(5)

              country  year          pop continent  lifeExp    gdpPercap
803             Japan  2007  127467972.0      Asia   82.603  31656.06806
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.97867
802             Japan  2002  127065841.0      Asia   82.000  28604.59190
695           Iceland  2007     301931.0    Europe   81.757  36180.78919
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.41907

In [11]:
df.sort_values('country',na_position='first').head(3)

        country  year         pop continent  lifeExp   gdpPercap
11  Afghanistan  2007  31889923.0      Asia   43.828  974.580338
4   Afghanistan  1972  13079460.0      Asia   36.088  739.981106
10  Afghanistan  2002  25268405.0      Asia   42.129  726.734055

In [14]:
df.describe()

             year           pop      lifeExp      gdpPercap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165877
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846989
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [17]:
df=df.sort_index()
df.head(4)

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138

In [19]:
df.reset_index()

      index      country  year         pop continent  lifeExp   gdpPercap
0         0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1         1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2         2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3         3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4         4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...     ...          ...   ...         ...       ...      ...         ...
1699   1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700   1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701   1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702   1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703   1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 7 columns]

In [22]:
df.sort_values(['lifeExp','gdpPercap']).reset_index()

,index,country,year,pop,continent,lifeExp,gdpPercap
0,1292,Rwanda,1992,7290203.0,Africa,23.599,737.068595
1,0,Afghanistan,1952,8425333.0,Asia,28.801,779.445314
2,552,Gambia,1952,284320.0,Africa,30.000,485.230659
3,36,Angola,1952,4232095.0,Africa,30.015,3520.610273
4,1344,Sierra Leone,1952,2143249.0,Africa,30.331,879.787736
...,...,...,...,...,...,...,...
1699,1487,Switzerland,2007,7554661.0,Europe,81.701,37506.419070
1700,695,Iceland,2007,301931.0,Europe,81.757,36180.789190
1701,802,Japan,2002,127065841.0,Asia,82.000,28604.591900
1702,671,Hong Kong China,2007,6980412.0,Asia,82.208,39724.978670
1703,803,Japan,2007,127467972.0,Asia,82.603,31656.068060

In [23]:
df.sort_values(['lifeExp','gdpPercap'],ascending=[False,True])

              country  year          pop continent  lifeExp     gdpPercap
803             Japan  2007  127467972.0      Asia   82.603  31656.068060
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
...               ...   ...          ...       ...      ...           ...
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
552            Gambia  1952     284320.0    Africa   30.000    485.230659
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595

[1704 rows x 6 columns]

In [34]:
 d= pd.DataFrame({'population': [58812491, 37522972, 339757,
339757, 339757, 38964, 11646, 11646, 11646],
'GDP': [2033594, 1833594 , 153594, 14520, 10128,
836, 139, 39, 539],
'alpha-2': ["SA", "CA", "AU", "MV", "IS",
"MC", "NU", "TV", "PW"]},
                  index=["South Africa", "Canada", "Australia",
"Maldives", "Iceland", "Monaco", "Niue",
"Tuvalu", "Palau"])
d.head()

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU
Maldives          339757    14520      MV
Iceland           339757    10128      IS

In [31]:
df.round({'lifeExp':2,'gdpPercap':3})

          country  year         pop continent  lifeExp  gdpPercap
0     Afghanistan  1952   8425333.0      Asia    28.80    779.445
1     Afghanistan  1957   9240934.0      Asia    30.33    820.853
2     Afghanistan  1962  10267083.0      Asia    32.00    853.101
3     Afghanistan  1967  11537966.0      Asia    34.02    836.197
4     Afghanistan  1972  13079460.0      Asia    36.09    739.981
...           ...   ...         ...       ...      ...        ...
1699     Zimbabwe  1987   9216418.0    Africa    62.35    706.157
1700     Zimbabwe  1992  10704340.0    Africa    60.38    693.421
1701     Zimbabwe  1997  11404948.0    Africa    46.81    792.450
1702     Zimbabwe  2002  11926563.0    Africa    39.99    672.039
1703     Zimbabwe  2007  12311143.0    Africa    43.49    469.709

[1704 rows x 6 columns]

In [36]:
d.nlargest(3,'population')

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU

In [37]:
d.nlargest(3,'population',keep='last')

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Iceland           339757    10128      IS

In [38]:
d

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU
Maldives          339757    14520      MV
Iceland           339757    10128      IS
Monaco             38964      836      MC
Niue               11646      139      NU
Tuvalu             11646       39      TV
Palau              11646      539      PW

In [40]:
d.nsmallest(3,['population','GDP'])

        population  GDP alpha-2
Tuvalu       11646   39      TV
Niue         11646  139      NU
Palau        11646  539      PW

In [41]:
d.nlargest(3,['population','GDP'])

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU

In [43]:
d.nlargest(3,'population',keep='all')

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU
Maldives          339757    14520      MV
Iceland           339757    10128      IS